mcgreg1/Tonuino-ESP32-I2S/src/main.cpp
    // Activate internal pullups for all buttons
    pinMode(DREHENCODER_BUTTON, INPUT_PULLUP);
    pinMode(PAUSEPLAY_BUTTON, INPUT_PULLUP);
    pinMode(NEXT_BUTTON, INPUT_PULLUP);
    pinMode(PREVIOUS_BUTTON, INPUT_PULLUP);

    // Init rotary encoder
    encoder.attachHalfQuad(DREHENCODER_CLK, DREHENCODER_DT);
    encoder.clearCount();
    encoder.setCount(initVolume*2);         // Ganzes Raster ist immer +2, daher initiale Lautstärke mit 2 multiplizieren


    if (wifiOn)
    {
        Serial.println("Wifi is enabled!");
        wifiManager();

        lastTimeActiveTimestamp = millis();     // initial set after boot

        if (wifiManager() == WL_CONNECTED) {
            // attach AsyncWebSocket for Mgmt-Interface
            ws.onEvent(onWebsocketEvent);
            wServer.addHandler(&ws);

            // attach AsyncEventSource
            wServer.addHandler(&events);

            wServer.on("/", HTTP_GET, [](AsyncWebServerRequest *request) {
                request->send_P(200, "text/html", mgtWebsite, templateProcessor);
            });

            wServer.on("/upload", HTTP_POST, [](AsyncWebServerRequest *request){
                request->send_P(200, "text/html", backupRecoveryWebsite);
            }, handleUpload);

            wServer.on("/restart", HTTP_GET, [] (AsyncWebServerRequest *request) {
                request->send_P(200, "text/html", restartWebsite);
                Serial.flush();
                ESP.restart();
            });

            wServer.onNotFound(notFound);
            wServer.begin();
        }
        // Only enable MQTT if requested
        #ifdef MQTT_ENABLE
            if (enableMqtt) {
                MQTTclient.setServer(mqtt_server, 1883);
                MQTTclient.setCallback(callback);
            }
        #endif
    }
    bootComplete = true;

    /*char *sdC = (char *) calloc(16384, sizeof(char));
    printSdContent(SD.open("/", FILE_READ), 16384, 1, sdC, 2);
    printSdContent(SD.open("/", FILE_READ), 16384, 1, sdC, 2);
    Serial.println(sdC);
    Serial.println(strlen(sdC));
    Serial.println(ESP.getFreeHeap());
    free (sdC);
    Serial.println(ESP.getFreeHeap());*/
}


void loop() {
    volumeHandler(minVolume, maxVolume);
    buttonHandler();
    doButtonActions();
    sleepHandler();
    deepSleepManager();
    rfidPreferenceLookupHandler();
    if (wifiOn)
    {
        if (wifiManager() == WL_CONNECTED) {
            #ifdef MQTT_ENABLE
                if (enableMqtt) {
                    reconnect();
                    MQTTclient.loop();
                    postHeartbeatViaMqtt();
                }
            #endif
            #ifdef FTP_ENABLE
                ftpSrv.handleFTP();
            #endif
        }
        #ifdef FTP_ENABLE
            if (ftpSrv.isConnected()) {
                lastTimeActiveTimestamp = millis();     // Re-adjust timer while client is connected to avoid ESP falling asleep
            }
        #endif
    }
}


// Some mp3-lib-stuff (slightly changed from default)
void audio_info(const char *info) {
    snprintf(logBuf, sizeof(logBuf) / sizeof(logBuf[0]), "info        : %s", info);
    loggerNl(logBuf, LOGLEVEL_INFO);
}
void audio_id3data(const char *info) {  //id3 metadata
    snprintf(logBuf, sizeof(logBuf) / sizeof(logBuf[0]), "id3data     : %s", info);
    loggerNl(logBuf, LOGLEVEL_INFO);
}
void audio_eof_mp3(const char *info) {  //end of file
    snprintf(logBuf, sizeof(logBuf) / sizeof(logBuf[0]), "eof_mp3     : %s", info);
    loggerNl(logBuf, LOGLEVEL_INFO);
    playProperties.trackFinished = true;
}
void audio_showstation(const char *info) {
    snprintf(logBuf, sizeof(logBuf) / sizeof(logBuf[0]), "station     : %s", info);
    loggerNl(logBuf, LOGLEVEL_NOTICE);
    char buf[255];
    snprintf(buf, sizeof(buf)/sizeof(buf[0]), "Webradio: %s", info);
    #ifdef MQTT_ENABLE
        publishMqtt((char *) FPSTR(topicTrackState), buf, false);
    #endif
}
void audio_showstreaminfo(const char *info) {
    snprintf(logBuf, sizeof(logBuf) / sizeof(logBuf[0]), "streaminfo  : %s", info);
    loggerNl(logBuf, LOGLEVEL_INFO);
}
void audio_showstreamtitle(const char *info) {
    snprintf(logBuf, sizeof(logBuf) / sizeof(logBuf[0]), "streamtitle : %s", info);
    loggerNl(logBuf, LOGLEVEL_INFO);
}
void audio_bitrate(const char *info) {
    snprintf(logBuf, sizeof(logBuf) / sizeof(logBuf[0]), "bitrate     : %s", info);
    loggerNl(logBuf, LOGLEVEL_INFO);
}
void audio_commercial(const char *info) {  //duration in sec
    snprintf(logBuf, sizeof(logBuf) / sizeof(logBuf[0]), "commercial  : %s", info);
    loggerNl(logBuf, LOGLEVEL_INFO);
}
void audio_icyurl(const char *info) {  //homepage
    snprintf(logBuf, sizeof(logBuf) / sizeof(logBuf[0]), "icyurl      : %s", info);
    loggerNl(logBuf, LOGLEVEL_INFO);
}
void audio_lasthost(const char *info) {  //stream URL played
    snprintf(logBuf, sizeof(logBuf) / sizeof(logBuf[0]), "lasthost    : %s", info);
    loggerNl(logBuf, LOGLEVEL_INFO);
}
